prefixes = {
    "q": 1e-30,  # квекто
    "r": 1e-27,  # ронто
    "y": 1e-24,  # иокто
    "z": 1e-21,  # зепто
    "a": 1e-18,  # атто
    "f": 1e-15,  # фемто
    "p": 1e-12,  # пико
    "n": 1e-9,  # нано
    "u": 1e-6,  # микро
    "m": 1e-3,  # милли
    "c": 1e-2,  # санти
    "d": 1e-1,  # деци
    "": 1.0,
    "da": 1e1,  # дека
    "h": 1e2,  # гекто
    "k": 1e3,  # кило
    "M": 1e6,  # мега
    "G": 1e9,  # гига
    "T": 1e12,  # тера
    "P": 1e15,  # пета
    "E": 1e18,  # экса
    "Z": 1e21,  # зетта
    "Y": 1e24,  # иотта
    "R": 1e27,  # ронна
    "Q": 1e30,  # кветта
}
